#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
    char arr0[] = "种一棵树最好的时间是十年前，而后是现在";
    char arr1[] = "我是计算机专业的一个学生,现在才发现时间过得是那么的快,马上快毕业了,但是感觉自己并没有学到太多东西。";
    char arr2[] = "为了能够在将来就业中获得更多优势，我将会把握现有的一些时间，将自己的编程水平在提升一个档次，除此之外在学一些其它方面的知识。";
    char arr3[] = "在编程的学习上我打算再次回顾加深一下自己的基础，同时需要多看一些大佬的代码，学习他们比较好的编程技巧和思路，在之前的学习中我认为提高编程能力最好的方法就是自己多思考多敲代码多总结。";
    char arr4[] = "因此在今后编程学习强化过程中我也是会延用一些之前一些好编程习惯。坚持每周写博客，坚持每天在github中上传我的代码。因为现在处于考研备考中，所以我没有太多的时间专门用来花费在编程的强化上。";
    char arr5[] = "我定给自己的最低目标就是每周学够10小时的编程，虽然用的时间不算多但是我觉得一年后一定会有大的提升，等我考上研，在去投入大量的时间在自己的编程等相关专业领域上。";
    char arr6[] = "我希望以后可以拿到腾讯的offer，成为腾讯的一个项目开发员。想去腾讯的原因是我觉得腾讯现在发展的挺好，了解到腾讯对员工的待遇好而且不怎么加班。";
    char arr7[] = "在往后专业能力的提升上我会经常用乔布斯的一句经典的话来勉励自己，Stay hungry,Stay foolish.";
   
    printf("\n");
    printf("\n");
    printf("                                     %s                             \n", arr0);
    printf("\n");
    printf("    %s", arr1);
    printf("%s\n", arr2);
    printf("\n");
    printf("    %s\n", arr3);
    printf("\n");
    printf("    %s", arr4);
    printf("%s\n", arr5);
    printf("\n");
    printf("    %s", arr6);
    printf("%s\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", arr7);

    return 0;
}