#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//一维数组的创建和初始化
// 数组的创建
//数组：
//数组是一组相同类型元素的集合。数组的创建方式：
//type_t  arr_name  [const_n]
//type_t 是指数组的元素类型
//const_n 是一个常量表达式，用来指定数组的大小

//#include <string.h>
//int main()
//{
//	//整型数组的初始化：
//	//int arr[8];//arr是数组名，8是元素的个数，[]括号里面的值一定是一个常量表达式
//	//char ch[5];//ch是数组名，5是元素的个数
//	//int a = 10;//初始化
//	////int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//	//int arr[10] = { 1,2,3,4,5 };//不完全初始化
//	//int arr2[] = { 1,2,3,4,5 };//等价于int arr2[5] = { 1,2,3,4,5 };
//	
//
//	//字符数组的初始化：
//	//char ch[5] = { 'b','i','t' };
//	//char ch2[] = { 'b','i','t' };
//
//	//char ch3[5] = "bit"; //b i t \0 0
//	//char ch4[] = "bit"; //b i t \0
//	char ch5[] = "bit";//[b i t \0]
//	char ch6[] = { 'b','i','t' };//[b i t]
//	//printf("%s\n", ch5);
//	//printf("%s\n", ch6);
//  
//  //数组长度和字符串长度是两种不同的东西，数组长度要加\0，而字符串长度不用加
//	printf("%d\n", strlen(ch5));//长度为3
//	printf("%d\n", strlen(ch6));//长度为随机值
//
//	return 0;
// }
////VS2022不支持变长数组，而C99语法支持变长数组 - 数组大小是变量
////linux 下的gcc对C99语法支持的比较好


//一维数组的使用：
//对于数组的使用，[]，是下标引用操作符，它其实就是数组访问的操作符 
//数组大小可以通过计算得到
//int main()
//{
//	int arr[10] = { 0 };//初始化第一个为0，剩下的默认初始化为0
//	arr[4] = 5;//[]-下标引用操作符
//	int i = 0;
//	//printf("%d\n", arr[4]);
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(arr[0]));//4
//	printf("----------------------\n");
//
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//
//}

//一维数组的存储：
//一维数组在内存中是连续存放的
//随着数组下标的增长，地址是由低到高变化的
//int main()
//{
//	//printf("%x\n", 0x12);//12
//	//printf("%p\n", 0x12);//000000000000000012,一个16进制位需要转换成4个二进制位，16X4=64个二进制位，相当于8个字节的空间大小
//
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("&arr[%d] = %p\n", i, &arr[i]);//打印地址用的%p，按照地址的格式打印就是16进制打印
//	}
//	return 0;
//}


//数组在内存中是连续存放的
//整型字符中没有‘\0’，只有字符数组中才有‘\0’
int main()
{
	//printf("%x\n", 0x12);//12
	//printf("%p\n", 0x12);//000000000000000012,一个16进制位需要转换成4个二进制位，16X4=64个二进制位，相当于8个字节的空间大小

	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int *p = arr;//数组名是数组首元素的地址,所以*p=1
	int i = 0;
	for (i = 0; i < 10; i++)
	{
		printf("%d ", *p);
		p++;//一个整型指针加1它会跳过一个整型的；一个字符加1，会跳过一个字符；一个浮点型的指针加1，会跳过一个浮点型的
	}
	return 0;
}