#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//不使用累计乘法的基础上，通过移位运算(<<)实现2的n次方的计算。

//数据范围:0<= n <= 31
//一行输入整数n(0<=n<31)
//输出对应的2的n次方的结果
//int main()
//{
//	int n = 0;
//	int a = 1;
//	scanf("%d", &n);
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		a *= 2;
//	}
//	printf("%d\n", a);
//	return 0;
//} 

//int main()
//{
//	int n = 0;
//	int a = 1;
//	scanf("%d", &n);
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//	   a = (1 << n); //1向左移动n位
//	}
//	printf("%d\n", a);
//	return 0;
//} 


//公务员面试现场打分。有7位考官，从键盘输入若干组成绩，每周7个分数(百分制),去掉一个最高分和一个最低分，输出每组的平均成绩。

//每一行，输入7个整数（0~100），代表7个成绩，用空格分隔。
//输出去掉最高分和最低分的平均 成绩，小数点后保留2位，每行输出后换行。
//int main()
//{
//	int arr[7] = { 23, 67, 78, 80, 54, 70, 34 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	//冒泡排序
//	int i = 0;
//	int flag = 1;
//	double a = 0;
//	for (i = 0; i < sz; i++)
//	{
//		//计算总共有多少行
//		int j = 0;
//		for (j =  0; j < sz - i; j++)
//		{
//			//计算每行需要比较几对
//			//比较：
//			if (arr[j] < arr[j+1])
//			{
//				flag = 0;
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//			}
//			if (flag == 1)
//			{
//				break;
//			}
//		}		
//	}
//
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	printf("\n");
//
//	for (i = 1; i < sz-1; i++)
//	{
//		a += arr[i];
//	}
//	
//	printf("%lf\n",a/(sz-2));
//	return 0;
//} 


//获得某年某月有多少天，输入年份和月份，计算这一年这个月有多少天。
//多组输入，一行有两个整数，分别表示年份和月份，用空格分隔。
//针对每组输入，输出为一行，一个整数，表示这一年这个月有多少天。

//非闰年
//31 28 31 30 31 30 31 31 30 31 30 31
//闰年29
int main()
{
	int y = 0;
	int m = 0;
	int days[12] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };
	while (scanf("%d %d", &y, &m) == 2)
	{
		int day = days[m-1];

		if ((y % 4 == 0 && y % 100 != 0) || (y % 400 == 0))
		{
			if (m == 2)
				day += 1;
		}
		printf("%d\n", day);
	}
	return 0;
} 