#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//数组元素可以是int,char,double
//一维数组在内存中是连续存放的
//一维数组可以通过下标[]来访问，也可以用指针*p来访问
//%p-打印地址（16进制）
//%d-打印整数（10进制）

//静态区里面-全局变量&&静态变量-创建的变量不初始化，则默认初始化为0；
//在栈上-创建的变量如果不初始化就是随机值
//int a;//全局变量不初始化，那么它的值就是0
//int main()
//{
//	int arr[100] = { 1,2,3,4,5,6 };
//	printf("%d\n", sizeof(arr));//结果是400，因为这有100个元素每个元素是整型
//	printf("%d\n", sizeof(arr[0]));//4
//	int sz = sizeof(arr) / sizeof(arr[0]);//计算元素的个数
//	printf("%d\n", sz);
//	////写代码来赋值1~100
//	int i = 0;
//	for (i = 0; i < sz; i++)
//	{
//		arr[i] = i + 1;
//
//	}
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	//static int b;
//	//printf("%d\n", b);//静态变量不初始化默认值也是0
//	//printf("%d\n", a);
//	//const int n = 10;//const修饰的是常变量，常变量是变量，是变量就不能放进数组里面，除非编译器支持
//	////但是在C++中const修饰的n就是常量
//	//int arr[10];
//	//int i = 0;
//	//for (i = 0; i < 10; i++)
//	//{
//	//	printf("%d\n", arr [i]);
//	//}
//
//	return 0;
//} 


////二维数组的创建和初始化
////二维数组的创建：
//int main()
//{
//	int arr[3][5];//二维数组三行五列
//	//int int int int int;
//	//int int int int int;
//	//int int int int int;
//	char arr[5][7];
//	return 0;
//}   


//二维数组的初始化
//行和列都是从0开始的

//int arr[3][5]： //二维数组首先要指定行在指定列才能锁定一个元素
 //    0   1   2   3   4
 // 0 int int int int int;
 // 1 int int int int int;
 // 2 int int int int int;

// int main()
//{
//	//int arr[3][5] = {1,2,3,4,5,6 };//不完全初始化 
//	// 1 2 3 4 5;
//	// 6 0 0 0 0;
//	// 0 0 0 0 0;
//
//	int arr[3][5] = { {1,2},{3,4},{5,6} };
//	// 1 2 0 0 0；
//	// 3 4 0 0 0；
//	// 5 6 0 0 0；
//
//	//int arr[][5] = {1,2,3,4,5,6 };//可以省略行，会自动根据初始化内容来确定数组的行数;但是不能省略列
//	// 1 2 3 4 5；
//	// 6 0 0 0 0；
//
//	return 0;
//} 

//二维数组打印：
//int main()
//{
//
//	int arr[3][5] = { {1,2},{3,4},{5,6} };
//	// 1 2 0 0 0；
//	// 3 4 0 0 0；
//	// 5 6 0 0 0；
//
//	//打印二维数组：
//	int i = 0;
//	for (i = 0; i < 3; i++) //行
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//
//	//int arr[][5] = {1,2,3,4,5,6 };//可以省略行，会自动根据初始化内容来确定数组的行数;但是不能省略列
//	// 1 2 3 4 5；
//	// 6 0 0 0 0；
//
//	return 0;
//}


//计算二维数组的大小：也用sizeof(),例如：
//int main()
//{
//	int arr[3][5] = { {1,2},{3,4},{5,6} };
//	// 1 2 0 0 0；
//	// 3 4 0 0 0；
//	// 5 6 0 0 0；
//
//	//打印二维数组：
//	int i = 0;
//	for (i = 0; i < sizeof(arr) / sizeof(arr[0]); i++) //行，sizeof(arr)表示整个数组的大小，一行一行的算，总共3行，每行5 x 4 = 20,所以3行就是60；
//	{
//		int j = 0;
//		for (j = 0; j < sizeof(arr[0]) / sizeof(arr[0][0]); j++)//列
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}


//二维数组在内存中的存储
//先把每个二维数组的地址打印出来分析
//二维数组在内存中也是连续存放的，因为每行连续元素之间都相差4，而且第一行最后一个元素与第二行第一个元素也相差4.
//如果把一个二维数组每一行看成一维数组，则第一行的一维数组数组名叫arr[0],则第二行的一维数组数组名叫arr[1],则第三行的一维数组数组名叫arr[2],
//二维数组还可以理解为是一维数组的数组
int main()
{
	int arr[3][5] = { {1,2},{3,4},{5,6} };
	// 1 2 0 0 0；
	// 3 4 0 0 0；
	// 5 6 0 0 0；

	//打印二维数组：
	int i = 0;
	for (i = 0; i < 3; i++) //行，sizeof(arr)表示整个数组的大小，一行一行的算，总共3行，每行5 x 4 = 20,所以3行就是60；
	{
		int j = 0;
		for (j = 0; j < 5; j++)//列
		{
			printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);
		}
		//printf("\n");
	}
	return 0;
}


//三维数组的创建
int main()
{
	int arr[3][4][6];//3表示有3个二维数组，每个 二维数组是3行6列

	return 0;
}
 