#define _CRT_SECURE_NO_WARNINGS 1

//转义字符

#include <stdio.h>

//int main()
//{
//	//转义字符斜杠\
//	//%c,打印出单个字符
//	//printf("%c\n",'\'');//将单引号转义为普通字符只需给他前面加一个\进行转义
//	//%s,打印出字符串
//	printf("%s\n", "abc");
//	printf("%s\n", "a");
//	printf("%s\n", "\"");//打印出一个字符双引号，只需在它前面加上一个斜杠\进行转义
//	printf("%s\n", "'");
//	// \t 是水平制表符相当于键盘上的Tab键
//	printf("%s\n", "c:\\test\\test.c");
//	printf("\n""c:\\test\\test.c"); // \\用于表示一个反斜杠，防止它被解释为一个转义序列符
//	//printf("\n""\n""\a"); // \a打印时会触发电脑蜂鸣
//
//	// \b  退格符
//	// \f  进纸符
//	// \n  换行
//	// \r  回车
//	// \t  水平制表符
//	// \v  垂直制表符
//	// 
//	// \130  ddd表示1~3个八进制的数字。如：\130x
//	// \xdd  dd表示两个十六进制数字。如：\x30 0
//
//
//
//
//	//printf在打印数据的时候，可以指定打印的格式
//	return 0;
//}
////printf("%d", 100);
////printf("%c", 'a');
////printf("%s", "abc");


//int main()
//{
//	//printf("%c\n",'\130');//8进制的130是十进制的多少呢？
//	//X  --ASCII码值是88
//	//printf("%c\n",'\104');//A - 65 - 8进制是：101
//	//printf("%c\n", '\x30'); //48 - '0'
//	//printf("%d\n", strlen("abc")); //3
//	// 
//	printf("%d\n", strlen("c:\test\328\test.c")); //14：\t是一个字符，\32是一个字符
//	return 0;   
//
//}

//注释是用来解释复杂代码的

int main()
{
	//int a=10; //C++注释风格
	/*
	int b = 0;
	*/  //C语言的注释风格 - 缺点不支持嵌套注释
	return 0;
}