#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//-1原码：10000000 00000000 000000000 0000001
//	//-1反码：11111111 11111111 111111111 1111110
//	//-1补码：11111111 11111111 111111111 1111111
//	//
//	// 11111111
//	// 11111111 11111111 11111111 11111111
//	// 11111111 11111111 11111111 11111110
//	// 10000000 00000000 00000000 00000001
//	//char只存8个比特位
//	//char到int需要整型提升，高位补符号位
//
//	signed char b = -1;
//	// 11111111
//    // 11111111 11111111 11111111 11111111
//    // 11111111 11111111 11111111 11111110
//    // 10000000 00000000 00000000 00000001
//
//	unsigned char c = -1;
//	// 11111111
//    // 00000000 00000000 00000000 11111111
//    // 00000000 00000000 00000000 11111111
//    // 00000000 00000000 00000000 11111111
//	//%d表示打印一个整型，一个整型有32个比特位
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1，-1，255
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d %d", &a, &b);
//	if (a >= 1 && b <= 100000)
//	{
//		while (1)
//		{
//			if (b % a == 0)
//			{
//				b = b / a;
//			}
//			else if (b % a != 0)
//			{
//				break;
//			}
//		}
//		
//		while (1)
//		{
//			if (a % b == 0)
//			{
//				a = a / b;
//			}
//			else if (a % b != 0)
//			{
//				break;
//			}
//		}
//		printf("%d\n", a * b);
//	}
//	return 0;
//}


//计算两个数的最小公倍数
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d %d", &a, &b);
//	int m = 0;
//	m = (a > b ? a : b); //取出a,b中的较大值放入m中
//	while (1)
//	{
//		if (m % b == 0 && m % a == 0)
//		{
//			break;
//		}
//		m++;
//	}
//	printf("%d\n", m);
//	return 0;
//}

//化简：
int main()
{
	int a = 0;
	int b = 0;
	scanf("%d %d", &a, &b);
	int i = 1;
	while((a * i) % b)
	{
		i++;
	}
	printf("%d\n", a * i);
	return 0;
}

